In [1]:
import numpy as np
import pandas as pd

In [3]:
dict1={
    "name":['naveen','pathak','Arman','vipin'],
    "marks":[36,89,32,65],
    "city":['varanasi','mirzapur','kanpur','jaunpur']
    
}

In [4]:
df=pd.DataFrame(dict1)

In [5]:
df

     name  marks      city
0  naveen     36  varanasi
1  pathak     89  mirzapur
2   Arman     32    kanpur
3   vipin     65   jaunpur

In [6]:
df.to_csv('friends.csv')

In [7]:
df.to_csv('friends_indexFalse.csv',index=False)

In [8]:
df.head(2)

     name  marks      city
0  naveen     36  varanasi
1  pathak     89  mirzapur

In [9]:
df.tail(2)

    name  marks     city
2  Arman     32   kanpur
3  vipin     65  jaunpur

In [10]:
df.describe()

           marks
count   4.000000
mean   55.500000
std    26.739484
min    32.000000
25%    35.000000
50%    50.500000
75%    71.000000
max    89.000000

In [13]:
naveen =pd.read_csv('naveen.csv.csv')

In [14]:
naveen

   TrainNo.  speed      city
0    120033    100  varanasi
1    763500    120  mirzapur
2    432878    140    kanpur
3     65377    200   jaunpur

In [15]:
naveen['speed']

0    100
1    120
2    140
3    200
Name: speed, dtype: int64

In [16]:
naveen['city']

0    varanasi
1    mirzapur
2      kanpur
3     jaunpur
Name: city, dtype: object

In [18]:
naveen['TrainNo.']

0    120033
1    763500
2    432878
3     65377
Name: TrainNo., dtype: int64

In [20]:
naveen['speed'][0]=60

C:\Users\naveen.pathak\AppData\Local\Temp\ipykernel_3668\595247591.py:1: SettingWithCopyWarning:
A value is trying to be set on a copy of a slice from a DataFrame

See the caveats in the documentation: https://pandas.pydata.org/pandas-docs/stable/user_guide/indexing.html#returning-a-view-versus-a-copy
  naveen['speed'][0]=60

In [21]:
naveen

   TrainNo.  speed      city
0    120033     60  varanasi
1    763500    120  mirzapur
2    432878    140    kanpur
3     65377    200   jaunpur

In [26]:
naveen.to_csv(naveen.csv.csv)

AttributeError: 'DataFrame' object has no attribute 'csv'